In [7]:
import numpy as np
import pandas as pd
from numpy import nan as NA

In [4]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [6]:
string_data[0] = None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [44]:
s1 = pd.Series([1,2,3,4,5,NA])
s1

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
5    NaN
dtype: float64

In [38]:
s1.isnull()

0    False
1    False
2    False
3    False
4    False
5     True
dtype: bool

In [39]:
s1.fillna(5)

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
5    5.0
dtype: float64

In [40]:
s1[s1.isnull()]

5   NaN
dtype: float64

In [41]:
s1.notnull()

0     True
1     True
2     True
3     True
4     True
5    False
dtype: bool

In [36]:
s1.dropna()

Series([], dtype: float64)

In [31]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],[NA,NA,NA],[NA,6.5,3]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [45]:
s1 = s1[s1.notnull()]
s1

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
dtype: float64

In [47]:
s1.index= [4,5,3,2,1]
s1

4    1.0
5    2.0
3    3.0
2    4.0
1    5.0
dtype: float64

In [50]:
s1[4] = None
s1

4    NaN
5    2.0
3    3.0
2    4.0
1    5.0
dtype: float64

In [52]:
s1.dropna(inplace= True)
s1

5    2.0
3    3.0
2    4.0
1    5.0
dtype: float64

In [54]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [60]:
cleaned =  data.dropna(axis = 0)#drop all rows with nan values
cleaned

     0    1    2
0  1.0  6.5  3.0

In [67]:
clean = data.dropna(thresh=2)
clean

     0    1    2
0  1.0  6.5  3.0
3  NaN  6.5  3.0

In [68]:
clean1 =  data.dropna(how = "all")
clean1

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [71]:
clean2 = data.dropna(how = "any")
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [112]:
df = pd.DataFrame(np.random.randn(7, 3))
df

          0         1         2
0  0.301253  0.532836  0.915887
1  1.590359  0.011766 -1.375970
2 -0.521995  0.139735 -0.252304
3 -0.228296  1.329851 -0.868074
4  0.285215  0.256420  1.467420
5  0.504412  1.629192  0.650075
6  0.402973  0.718319  1.262771

In [113]:
df.iloc[:4, 1] = NA
df.iloc[:2, 2] = NA

df

          0         1         2
0  0.301253       NaN       NaN
1  1.590359       NaN       NaN
2 -0.521995       NaN -0.252304
3 -0.228296       NaN -0.868074
4  0.285215  0.256420  1.467420
5  0.504412  1.629192  0.650075
6  0.402973  0.718319  1.262771

In [114]:
df.dropna()

          0         1         2
4  0.285215  0.256420  1.467420
5  0.504412  1.629192  0.650075
6  0.402973  0.718319  1.262771

In [115]:
df

          0         1         2
0  0.301253       NaN       NaN
1  1.590359       NaN       NaN
2 -0.521995       NaN -0.252304
3 -0.228296       NaN -0.868074
4  0.285215  0.256420  1.467420
5  0.504412  1.629192  0.650075
6  0.402973  0.718319  1.262771

In [116]:
df.fillna({1:3,2:6})

          0         1         2
0  0.301253  3.000000  6.000000
1  1.590359  3.000000  6.000000
2 -0.521995  3.000000 -0.252304
3 -0.228296  3.000000 -0.868074
4  0.285215  0.256420  1.467420
5  0.504412  1.629192  0.650075
6  0.402973  0.718319  1.262771

In [117]:
df.fillna(df.mean())

          0         1         2
0  0.301253  0.867977  0.451978
1  1.590359  0.867977  0.451978
2 -0.521995  0.867977 -0.252304
3 -0.228296  0.867977 -0.868074
4  0.285215  0.256420  1.467420
5  0.504412  1.629192  0.650075
6  0.402973  0.718319  1.262771

In [118]:
df[1]

0         NaN
1         NaN
2         NaN
3         NaN
4    0.256420
5    1.629192
6    0.718319
Name: 1, dtype: float64

In [119]:
df

          0         1         2
0  0.301253       NaN       NaN
1  1.590359       NaN       NaN
2 -0.521995       NaN -0.252304
3 -0.228296       NaN -0.868074
4  0.285215  0.256420  1.467420
5  0.504412  1.629192  0.650075
6  0.402973  0.718319  1.262771

In [120]:
df.fillna(method = "bfill") #backword fill

          0         1         2
0  0.301253  0.256420 -0.252304
1  1.590359  0.256420 -0.252304
2 -0.521995  0.256420 -0.252304
3 -0.228296  0.256420 -0.868074
4  0.285215  0.256420  1.467420
5  0.504412  1.629192  0.650075
6  0.402973  0.718319  1.262771

In [122]:
df[0][1] = 0
df

          0         1         2
0  0.301253       NaN       NaN
1  0.000000       NaN       NaN
2 -0.521995       NaN -0.252304
3 -0.228296       NaN -0.868074
4  0.285215  0.256420  1.467420
5  0.504412  1.629192  0.650075
6  0.402973  0.718319  1.262771

In [ ]:
df2 = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],'k2': [1, 1, 2, 3, 3, 4, 4]})